app/models/concerns/cart.rb

SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ? AND "lineitems"."product_id" = ? LIMIT ?  [["cart_id", 12], ["product_id", 3], ["LIMIT", 1]]
---
    def add_this_item(product_id)
        current_item = self.lineitems.find_by(product_id: product_id)