app/controllers/lineitems_controller.rb

  def index
    @lineitems = Lineitem.all
---
SELECT "lineitems".* FROM "lineitems"

  def create
    # product = Product.find(params[:product_id])
    #@lineitem = Lineitem.new(lineitem_params)
    #we need @cart and product to build new lineitems
    #@lineitem = @cart.lineitems.build(product_id: params[:product_id])
    @lineitem = @cart.add_this_item(params[:product_id])

    respond_to do |format|
      if @lineitem.save
---
INSERT INTO "lineitems" ("product_id", "cart_id", "created_at", "updated_at", "quantity", "order_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["product_id", 3], ["cart_id", 4], ["created_at", "2023-11-19 03:21:29.110488"], ["updated_at", "2023-11-19 03:21:29.110488"], ["quantity", 1], ["order_id", nil]]
UPDATE "lineitems" SET "updated_at" = ?, "quantity" = ? WHERE "lineitems"."id" = ?  [["updated_at", "2023-11-19 06:01:12.541767"], ["quantity", 2], ["id", 4]]

    def set_lineitem
      @lineitem = Lineitem.find(params[:id])
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]