app/controllers/shopper_controller.rb

  def index
    @products = Product.order(:name) # or Product.all
---
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC